{
  "services": [
    {
      "id": 1,
      "title": "Digital Marketing & Communications",
    "slug": "1",
      "description": "<h3>We create digital marketing strategies that deliver results. From websites and social media to campaign design and email marketing, we craft messages that connect. We work with businesses across industries, ensuring every campaign is tailored, relevant, and aligned with your brand and audience.</h3><div><span><b>See how we build successful B2B content strategies across the GCC:</b> B2B Content Strategy That Converts in the GCC</span><span><b>Explore how we measure content marketing ROI across the GCC:</b> ROI of Content Marketing in the GCC</span><span><b>Read how we optimize for B2B SEO across the UAE and beyond:</b> SEO for B2B Companies in the UAE</span></div>",
      "image": "/image-placeholder.png"
    },

    {
      "id": 2,
      "title": "Executive & Thought Leadership Writing",
      "slug": "2",
      "description":"<h3>We help leaders find their voice and build trust. Our writers create articles, speeches, and thought pieces that reflect experience and insight. We understand the needs of CEOs, CMOs, and senior teams across industries, and craft messages that educate, engage, and inspire.</h3><div><span><b>Learn how ghostwriting can boost your executive brand across the GCC:</b> How Ghostwriting Can Boost Your Executive Brand in the GCC</span></div>",
        "image": "/image-placeholder.png"
    },
    {
      "id": 3,
      "title": "Multilingual Localization",
      "slug": "3",
      "description":"<h3>We help you adapt your content for different languages and markets. Our localization goes beyond translation, we adjust tone, style, and context to fit the needs of every audience. We make sure your message doesn’t just cross borders, it finds its place and its voice.</h3><div><span><b>Why translation alone is not enough for the GCC:</b> Multilingual Marketing in the GCC: Why Translation Isn’t Enough</span><span><b>See the benefits of localization for B2B brands across the GCC:</b> 5 Key Benefits of Content Localization for GCC B2B Brands</span></div>",
        "image": "/image-placeholder.png"
    },
    {
      "id": 4,
      "title": "Visual Storytelling & Design",
      "slug": "4",
        "image": "/image-placeholder.png",
        "description":"<h3>We turn ideas into captivating visuals. From infographics and illustrations to campaign design and layouts, we create compelling imagery that captures attention and delivers your message clearly and creatively.</h3>"
    },
    {
      "id": 5,
      "title": "Voice over & Subtitles Services",
      "slug": "5",
      "description":"<h3>We produce voice overs and subtitles that carry your brand’s voice across languages, platforms, and screens. Our team works with precision to match tone, context, and delivery for every video and audio project.</h3>",
        "image": "/image-placeholder.png"
    },
    {
      "id": 6,
      "title": "Industries We Serve",
      "slug": "6",
      "description":"<h2>We work with businesses across sectors, including:Culture & Education | Government & International Organizations | Entertainment | F&B & Food Aggregation | Destination Marketing | Aviation, Automotive & Mobility | Oil & Gas, Energy & Engineering | Consumer Electronics, Retail & Luxury | Banking & Trading | Healthcare | Real Estate Each industry has its voice. We help you find it.</h2>",
        "image": "/image-placeholder.png"
    }
  ],
  "blogs": [
    {
      "id": 1,
      "title": "B2B Content Strategy That Converts in the GCC",
      "slug": "how-to-build-a-b2b-content-strategy-that-converts-in-the-gcc",
      "intro":"Doing B2B marketing in the Gulf takes more than global strategy. It takes local understanding.<br/>Buyers in the GCC don’t move fast. They don’t buy from strangers. They need to trust you. They need to see value. That means your content must speak clearly, feel local, and work at every step.<br/>Here’s how to build a B2B content strategy that works across the Gulf.",
      "excerpt": "Doing B2B marketing in the Gulf takes more than global strategy. It takes local understanding.",
      "content": 
      [
        {"title":"Why GCC Buyers Need a Different Approach",
        "description":"In the GCC, most B2B deals start with relationships. People buy from people they trust. It’s personal, slow, and it involves more than one person.<br/>You may need to convince a CEO, a finance team, and a tech manager. Therefore, your content must speak to each role. Also, don’t expect quick wins. It often takes months to close a deal. You need to stay visible, helpful, and relevant the whole time."},

        {"title":"Where to Reach B2B Audiences in the Gulf",
        "description":"GCC buyers are online, a lot. Internet use in the UAE, Saudi Arabia, and Qatar is near 100%. LinkedIn is where most B2B action happens.<br/>The UAE alone has 9.7 million LinkedIn users. That’s over 90% of the population.<br/>Your brand should be there. Share useful posts, and make sure you write in English and Arabic. Arabic posts get up to 50% more engagement.<br/>Keep it real. Skip the slick promo videos. Try short explainers, product tips, or webinar clips. Usually videos that are under 3 minutes, easy to follow, and helpful do the best in this context."},
        {
          "title":"Use Email and WhatsApp the Right Way",
          "description":"Email still works, if it’s short and useful. Remove the unnecessary fluff, add value, and keep it mobile-friendly.<br/>WhatsApp is huge in the Gulf. In the UAE, over 85% of people use it daily.<br/>Use it for quick follow-ups or reminders, but don’t spam. Always ask first."
        },
        {
          "title":"How to Nurture Leads Without Pushing",
          "description":"Don’t expect buyers to act after one email, one video, or one meeting. You have to stay present over time.<br/>Start with something small, like a checklist or a guide. Follow up with a short video. <br/>Later, share a case study. Keep showing how you solve their problem. Mention their name, country, and industry. Show them this isn’t a bulk message. It’s personalized for them.<br/>And when they’re ready, have someone real reach out. No bots, no pressure. Just a person."
        },
        {
          "title":"Use Events to Build Trust",
          "description":"In-person meetings still matter. A handshake, a smile, a real chat, these build trust fast.<br/>GITEX, WETEX, Gulfood, big events like these are full of serious B2B buyers. Make sure you use them properly. If someone visits your booth, follow up. Send a thank you. Invite them to a webinar. Keep the link warm."
        },
        {
          "title":"Make Your Content Feel Local",
          "description":"The Gulf is not one place. A buyer in Riyadh wants different proof than a buyer in Dubai or Doha.<br/>Use local case studies. Reference local goals like Vision 2030. Use the right tone, formal when needed, clear always.<br/>Don’t just translate. Localize. People can tell the difference."
        },
        {
          "title":"Mix Technology With Human Connection",
          "description":"Tools can help. AI can segment your audience or suggest better subject lines. But GCC buyers want real relationships. They want to deal with people, not platforms.<br/>Use tech to support the process. Let your team do the connecting."
        },
        {
          "title":"Watch What Works and Adapt",
          "description":"Set simple goals. Do people open the email? Watch the video? Share the post?<br/>Drop what doesn’t work. Double down on what does. If a short video pulls leads and a whitepaper doesn’t, that’s your answer.<br/>Test. Learn. Adjust."
        },
        {
          "title":"Real B2B Results From the GCC",
          "description":"One UAE startup, Tumodo, more than doubled their conversion rate in one year. How? Strong content, local targeting, and in-person follow-ups.<br/>Al Masaood Power, a local industrial brand, created content for each of its target sectors. It wasn’t fancy. Just focused. Blogs, brochures, and posts built around what their clients needed.<br/>That’s what smart content does. It speaks clearly, reaches the right people, and earns trust."
        },
        {
          "title":"Final Takeaway",
          "description":"If you want your B2B content to work in the GCC, remember three things:<br/><ul><li>• Be useful. Be local. Be human.</li><li>• Speak to your audience in their language. On the platforms they trust. With content that actually helps.</li><li>• That’s how you build trust. That’s how you win.</li></ul>"
        }
    ],
      "author": "Mira Denal",
      "date": "2025-06-10",
      "image": "/blogs/blog1.png"
    },
    {
      "id": 2,
      "title": "Why SEO Writing Still Matters",
      "slug": "why-seo-writing-matters",
      "intro":"",
      "excerpt": "SEO is not dead — it just evolved. Here's how to write for both humans and search engines.",
      "content": 
      [{"title":"test","description":"test"}
    ],
      "author": "Tomas Vey",
      "date": "2025-06-08",
      "image": "/image-placeholder.png"
    },
    {
      "id": 3,
      "title": "Top 5 Tools for Content Teams",
      "slug": "top-tools-content-teams",
      "intro":"",
      "excerpt": "These tools can level up your planning, writing, and distribution game.",
      "content": 
      [{"title":"test","description":"test"}
    ],
      "author": "Kara Ilon",
      "date": "2025-06-04",
      "image": "/image-placeholder.png"
    },
    {
      "id": 4,
      "title": "Mastering TikTok Scripts",
      "slug": "mastering-tiktok-scripts",
      "excerpt": "Short-form video needs sharp storytelling. Here’s how to write it.",
      "intro":"Doing B2B marketing in the Gulf takes more than global strategy. It takes local understanding.<br/>Buyers in the GCC don’t move fast. They don’t buy from strangers. They need to trust you. They need to see value. That means your content must speak clearly, feel local, and work at every step.<br/>Here’s how to build a B2B content strategy that works across the Gulf.",
      "content": 
      [{"title":"Why GCC Buyers Need a Different Approach","description":"In the GCC, most B2B deals start with relationships. People buy from people they trust. It’s personal, slow, and it involves more than one person.<br/>You may need to convince a CEO, a finance team, and a tech manager. Therefore, your content must speak to each role. Also, don’t expect quick wins. It often takes months to close a deal. You need to stay visible, helpful, and relevant the whole time."}
    ],
      "author": "Rafi Semor",
      "date": "2025-06-02",
      "image": "/image-placeholder.png"
    },
    {
      "id": 5,
      "title": "Email Copy That Converts",
      "slug": "email-copy-that-converts",
      "intro":"",
      "excerpt": "Turn opens into actions with better copywriting.",
      "content": 
      [{"title":"test","description":"test"}
    ],
      "author": "Nyla Ferik",
      "date": "2025-06-01",
      "image": "/image-placeholder.png"
    }
  ]
}
